import { Pressable, ScrollView, StyleSheet, Text, View } from "react-native";
import { Ionicons } from "@expo/vector-icons";

const TermsAndConditionsAr = ({ changeLang, onHide }) => {
  return (
    <View
      style={{
        backgroundColor: "#fff",
        padding: 22,
      }}
    >
      <View>
        <Pressable onPress={onHide}>
          <Ionicons name="close" size={24} color="black" />
        </Pressable>
      </View>
      <Text
        style={{
          fontSize: 22,
          textAlign: "center",
          marginBottom: 10,
          direction: "rtl",
        }}
      >
        ألاحكام والشروط
      </Text>
      <View
        style={{
          display: "flex",
          justifyContent: "center",
          alignItems: "center",
        }}
      >
        <Pressable
          style={{
            backgroundColor: "#0d6efd",
            paddingHorizontal: 10,
            paddingVertical: 5,
            borderRadius: 5,
            marginBottom: 30,
          }}
          onPress={changeLang}
        >
          <Text style={{ color: "#fff", fontWeight: "bold" }}>Arabic</Text>
        </Pressable>
      </View>
      <ScrollView dir="rtl" lang="ar">
        <Text style={{ direction: "rtl" }}>
          شروط الخدمة لدى muze y network يسرنا التعاون والتعمل معكم واليكم
          الشروط والاحكام
        </Text>
        <View>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              اولا : أهلا بك في muze y network .
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  ما لم يتم الاتفاق خطيا مع muze y network على خلاف ذلك، سوف
                  تتضمن اتفاقيتك الشروط والأحكام الواردة في هذه الوثيقة، والتي
                  يشار إليها لاحقا بـ "الشروط العامة
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  كما تتضمن اتفاقيتك مع muze y network شروط أية إشعارات قانونية
                  تنطبق على الخدمات، إضافة إلى الشروط العامة. ويشار الى جميع هذه
                  الشروط لاحقا فى هذه الوثيقة ب "الشروط الاضافية"
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إن الشروط العامة والشروط الإضافية تشكل معا اتفاقية قانونية
                  ملزمة بينك وبين muze y network فيما يتعلق باستعمالك للخدمات.
                  ومن المهم أن تأخذ الوقت الكافي لقراءتها بدقة. ويشار أدناه إلى
                  هذه الاتفاقية القانونية بـ "الشروط"
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              ثانيا : قبول الشروط
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  لكي تستخدم الخدمات يتعين عليك أولا أن توافق على الشروط، ولا
                  يمكنك استعمال الخدمات قبل قبولك بالشروط
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  يمكن قبول الشروط عبر أي من الخطوتين التاليتين:
                </Text>
                <View>
                  <View>
                    <Text style={{ direction: "rtl" }}>
                      النقر على خيار القبول أو الموافقة على الشروط حيثما توفره
                      لك muze y network في واجهة التطبيق الخاصة بالمستخدم لاى من
                      الخدمات
                    </Text>
                  </View>
                  <View>
                    <Text style={{ direction: "rtl" }}>
                      استعمال الخدمات فعليا. وفى هذه الحالة تدرك وتوافق ان muze
                      y ستعتبر استخدامك للخدمات بمثابة قبول بالشروط من تلك
                      اللحظة فصاعدا
                    </Text>
                  </View>
                </View>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  للتمتع بالخدمات يجب ان تكون ضمن السن القانوني الذي يخولك إبرام
                  عقد ملزم muze y network
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              ثالثا : لغة الشروط
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  حيثما توفر لك muze y network ترجمة للنسخة الإنجليزية من
                  الشروط، فإنك توافق على أن الترجمة قد يتم توفيرها للتسهيل عليك
                  فقط وأن النسخة الإنجليزية للشروط هي النسخة التي سوف تعتمد
                  وتحكم علاقتك بـ muze y network
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              رابعا : تقديم الخدمات
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إن لـ muze y network حول العالم شركات فرعية وشركات شقيقة
                  ("الشركات الفرعية والشقيقة"). وهذه الشركات ستقوم أحيانا
                  بتزويدك بالخدمات نيابة عن muze y network نفسها. وعليه، فإنك
                  تقر وتوافق بأن الشركات الفرعية والشقيقة ستزودك بالخدمات
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  ن muze y network لكي توفر لمستخدميها أفضل خبرة ممكنة، وعليه،
                  فإنك تقر وتوافق بأن شكل وطبيعة الخدمات التي توفرها يمكن أن
                  تتغير من وقت لآخر ودون سابق إشعار إليك
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إنك تقر و توافق بأن لشركة muze y network وبمحض اختيارها أن
                  توقف (بشكل مؤقت أو دائم) تزويد الخدمات (أو أي من خصائص
                  الخدمات) إليك أو إلى مستخدميها بشكل عام دون إشعار مسبق
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              خامسا : استعمالك للخدمات
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  بغية الدخول إلى خدمات معينة، قد يتعين عليك تقديم بعض المعلومات
                  الخاصة بك(مثل الهوية أو العنوان وتفاصيل اإلتصال) كجزء من عملية
                  تسجيل اشتراكك في الخدمة، أو كجزء من استمرار استعمالك للخدمات.
                  وتوافق على أن أية معلومات تقدمها لشركة network y muze لغرض
                  تسجيل اشتراكك ستكون دائماً صحيحة ودقيقة ومحدثة وعلى مسئوليتك
                  الشخصية .
                </Text>
              </View>

              <View>
                <Text style={{ direction: "rtl" }}>
                  إنك توافق على استعمال الخدمات فقط لألغراض التي تمسح بها الشروط
                  والقوانين أو األنظمة أو القواعد أو التعليمات السائدة في الدولة
                  المعنية العملية المقبولة عموما .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إنك توافق على عدم الدخول (أو محاولة الدخول)إلى أي من الخدمات
                  بأي طريقة سوى من خالل واجهة التفاعل التي توفرها network y muze
                  .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  إنك توافق على أن ال تشارك في أي نشاط يتعارض مع الخدمات (أو
                  أجهزة خدمة المعلومات المركزية والشبكات المرتبطة بالخدمات) أو
                  يعيق استعمالها.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  ما لم يتم السماح لك بذلك بموجب اتفاقية منفصلة مع network y
                  muze ، إنك توافق على عدم إعادة إنتاج الخدمات أو تصويرها أو
                  نسخها أو بيعها أو المتاجرة فيها أو إعادة بيعها ألي غرض .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .إنك توافق على أنك وحدك المسؤول (وأن network y muze ليست
                  مسؤولة بأي شكل تجاهك وال تجاه أي طرف آخر) عن أي إخالل
                  بالتزاماتك المترتبة عليك بموجب الشروط وعن نتائج ذلك اإلخالل
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              سادسا : أمن كلمات المرور والحساب الخاص بك
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .إنك تدرك وتوافق على أنك مسؤول عن المحافظة على سرية كلمات
                  المرور الخاصة بأي حساب تستخدمه للدخول إلى الخدمات.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .وبناء عليه، فإنك توافق على أن تكون المسؤول الوحيد تجاه
                  network y muze عن جميع األنشطة التي تتم من خالل حسابك .
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              سابعا : محتويات الخدمات{" "}
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إنك تدرك أن جميع المعلومات (مثل ملفات البيانات، النصوص
                  المكتوبة، برامج الكمبيوتر، الموسيقى، الملفات السمعية، الصور،
                  األفالم المصورة أو غير ذلك من الصور) التي يمكنك الدخول إليها
                  ضمن أو من خالل استعمالك للخدمات هي مسؤولية الشخص الذي نشأت عنه
                  هذه المحتويات وحده. ويشار إلى جميع هذه المعلومات فيما يلي بـ
                  "المحتويات."
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  ينبغي عليك أن تدرك أن المحتويات المقدمة إليك كجزء من الخدمات،
                  بما في ذلك ودون حصر اإلعالنات ورعاية المحتويات ضمن الخدمات قد
                  تكون محمية بقانون حقوق الملكية الفكرية التي تملكها الجهات
                  الراعية أو الجهات المعلنة التي توفر تلك المحتويات لـ( network
                  y muze أو يملكها أشخاص أو شركات بالنيابة عنهم) . ولذا ال يجوز
                  لك تعديل تلك المحتويات أو استئجارها أوتأجيرها أو إقراضها أو
                  بيعها أو توزيعها أو اشتقاق أعمال بناء عليها (سواء كليا أو
                  جزئيا) ما لم تبلغك network y muze أو مالكو تلك المحتويات صراحة
                  بإمكانية القيام بذلك، بموجب اتفاقية منفصلة .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .تحتفظ network y muze بحقها (ولكن دون أي التزام) في فحص أي أو
                  كافة المحتويات ومراجعتها واختصارها وتنقيحها وتعديلها ورفضها و
                  إزالتها من أي من الخدمات.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .إنك تدرك أن استعمالك للخدمات قد يعرضك لمحتوى تجد أنه مزعج أو
                  غير الئق أو غير مرغوب فيه، وتعلم أنك في هذا الشأن تستعمل
                  الخدمات على مسؤوليتك .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إنك توافق على أنك وحدك المسؤول (وأن network y muze ال تتحمل
                  أية مسؤولية تجاهك أو تجاه أي طرف ثالث) عن المحتويات التي
                  تنشئها بنفسك أو تنشرها أو تعرضها أثناء استعمالك للخدمات وعن
                  أية نتائج تترتب على تصرفاتك.
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              سادسا : أمن كلمات المرور والحساب الخاص بك
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .إنك تدرك وتوافق على أنك مسؤول عن المحافظة على سرية كلمات
                  المرور الخاصة بأي حساب تستخدمه للدخول إلى الخدمات.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .وبناء عليه، فإنك توافق على أن تكون المسؤول الوحيد تجاه
                  network y muze عن جميع األنشطة التي تتم من خالل حسابك .
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              ثامنا : الحقوق الخاصة
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  إنك تدرك وتوافق على ان( network y muze أو المرخصين لها)يملكون
                  كامل الحق القانوني وحق الملكية والمصلحة في الخدمات بما في ذلك
                  أية حقوق ملكية فكرية موجودة ضمن الخدمات
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  ما لم تكن قد اتفقت مع network y muze خطيا على خالف ذلك، ال شيء
                  في هذه الشروط يمنحك الحق في استعمال أسماء network y muze
                  التجارية أو عالماتها أو عالمات خدمتها أو شعاراتها أو أسماء
                  مواقعها وغير ذلك من خصائص االسم التجاري الخاصة بها.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  . - إنك توافق على أنه لن تقوم بإزالة أو إخفاء أو تغيير أية
                  إشعارات حقوق خاصة)بما في ذلك إشعارات حقوق التأليف والعالمات
                  التجارية( التي يمكن أن تكون ملحقة بالخدمات أو مشمولة فيها.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  ما لم تكن قد اتفقت مع network y muze صراحة وخطيا على خالف ذلك،
                  إنك توافق على أنك أثناء استعمال الخدمات، لن تستخدم أية عالمة
                  تجارية أو عالمة خدمة أو اسم تجاري أو شعار عائد ألي شركة أو
                  مؤسسة بطريقة يمكن أن تسبب أو تهدف إلى التسبب في إحداث لبس
                  بخصوص المالك أو المستخدم المرخص له استعمال هذه العالمات أو
                  األسماء أو الشعارات.
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              تاسعا : الترخيص من network y muze
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إن network y muze تمنحك ترخيصا شخصيا حول العالم وبرسوم وغير
                  قابل للتنازل وغير حصري باستعمال البرنامج الذي تزودك به network
                  y muze كجزء من الخدمات المزودة لك وهذا الترخيص هو فقط لغرض
                  تمكينك من استعمال والتمتع بمنفعة الخدمات كما هي مزودة لك من
                  قبل network y muze وبالطريقة التي تسمح بها الشروط.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  ل يجوز لك (وال يجوز لك أن تسمح ألحد آخر) بنسخ أو تعديل أو
                  إنشاء عمل مشتق من أو إعادة إنتاج بالهندسة العكسية أو فك أو
                  محاولة انتزاع مصدر الرمز للبرنامج أو أي جزء منه، ما لم يكن ذلك
                  مسموحا به أو مطلوبا صراحة بموجب القانون أوفي حال تم إبالغك
                  خطيا بشكل محدد من قبل network y muze بأنه يجوز لك فعل ذلك.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  بالقيام بذلك، ال يجوز لك التنازل (أو منح ما لم تكن network y
                  muze قد منحتك إذنًا خطياًمحدداً ترخيص من الباطن)عن حقوقك
                  باستعمال البرنامج أو منح ضمانة من جراء حقوقك باستعمال البرنامج
                  أو نقل أي جزء من حقوقك باستعمال البرنامج.
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              عاشرا: محتويات الترخيص لك
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .إنك تحتفظ بحق التأليف وأية حقوق أخرى تملكها مسبقاً في
                  المحتويات التي تسلمها أو تنشرها أو تعرضها في ترخيصاً أو من
                  خالل الخدمات. من خالل تسليم أو نشر أو عرض المحتويات، فإنك تمنح
                  network y muze دائما بإعادة إنتاج وتكييف وتعديل وترجمة ً وغير
                  قاب ٍل للنقض وفي كل أنحاء العالم وبدون رسوم وغير حصري ونشر
                  وإنجاز علناً وعرض علناً وتوزيع أي من المحتويات التي تسلمها أو
                  تنشرها أو تعرضها في أو من خالل الخدمات. وهذا الترخيص هو فقط
                  لغرض تمكين network y muze من عرض وتوزيع وترويج الخدمات ويمكن
                  سحبه بالنسبة لخدمات معينة كما هو محدد ضمن الشروط اإلضافية لتلك
                  الخدمات .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إنك توافق على أن هذا الترخيص يشمل الحق لشركة network y muze في
                  توفير تلك المح تويات للشركات والمؤسسات واألشخاص اآلخرين الذين
                  ل لشركة عالقة بهم لتوفير خدمات مشتركة واستعمال تلك المحتويات
                  فيما يتعلق بتوفير تلك الخدمات.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  . إنك تؤكد وتضمن لشركة network y muze أنه لديك جميع الحقوق
                  والسلطات والصالحيات الالزمة لمنح الترخيص المذكور أعاله .
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              حادى عشر : تحديث البرنامج
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  إن البرنامج الذي تستخدمه يمكن أن يحمل ويركب من وقت آلخر تحديثا
                  من .network y muze والهدف من هذا التحديث هو تحسين الخدمات
                  وتطويرها ورفع مستواها ويمكن أن يكون على شكل إصالح عيوب أو
                  تحسين وظائف أو تركيبات برمجية جديدة أو نسخا جديدة بالكامل.
                  وإنك توافق على استالم مثل هذه التحديثات (وتسمح لشركة network y
                  muze بتسليمها لك) كجزء من استعمالك للخدمات.
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              ثان عشر : إنهاء عالقتك مع network y muze{" "}
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  تستمر الشروط نافذة المفعول إلى أن يتم إنهاؤها إما من قبلك أو
                  من قبل network y muze كما هو مبين أدناه .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  إذا أردت إنهاء اتفاقيتك القانونية مع network y muze ، يمكنك
                  فعل ذلك من خالل )أ( إشعار network y muze في أي وقت )ب( إقفال
                  حساباتك لجميع الخدمات التي تستعملها .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  يجوز لشركة network y muze في أي وقت إنهاء اتفاقيتها القانونية
                  معك في حال: )أ( خالفت أي نص من نصوص الشروط ) ب( ، إذا كان أو
                  أصبح تقديم الخدمات إليك غير مشروع قانونا ( )ج( قام الشريك الذي
                  قدمت معه network y muze الخدمات لك بإنهاء عالقته مع الشركة أو
                  توقف عن تقديم الخدمة لك )د( قررت network y muze وقف تقديم
                  الخدمات لجميع المستخدمين في البلد الذي تقيم فيه أو الذي تستعمل
                  الخدمة منه، أو )هـ( أصبح تقديم الخدمة لك غير مجدٍ تجارياً من
                  وجهة نظر..network y muze
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              ثالث عشر :استبعاد الضمانات{" "}
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  ليس في هذه الشروطما يستبعد أو يقيد ضمان network y muze أو
                  مسؤوليتها عن الخسائر التي قد ال تكون استبعدت أو قيدت بشكل
                  قانوني بفعل تطبيق القانون. فبعض البلدان ال تسمح قوانينها
                  باستبعاد بعض الضمانات أو الشروط أو القيود أو استبعاد المسؤولية
                  عن الخسارة أو الضرر الناجم عن اإلهمال أو مخالفة العقد أو
                  مخالفة الشروط الضمنية، أو األضرار العرضية أو التبعية.
                  وبالتالي، فإن القيود القانونية المطبقة في بلدك فقط هي ما ينطبق
                  عليك وستكون مسؤوليتنا محدودة بالحد األ قصى المسموح به نظاما.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  إنك تدرك تماما وتوافق على أن استعمالك للخدمات على مسؤوليتك
                  وحدك وأن الخدمات تقدم إليك "كما هي" و"كما هي متوفرة."
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  وعلى وجه الخصوص، إن network y muze وشركاتها الفرعية والشقيقة
                  واألطراف المرخص لها من قبلها ال تؤكد وال تضمن لك أن: )أ (
                  استعمالك للخدمات سيلبي احتياجاتك، )ب( استعمالك للخدمات لن
                  يتعرض للتوقف وسيتوفر في الوقت المحدد وسيكون آمن أو خاليا من
                  األخطاء، )ت( أية معلومات تحصل عليها نتيجة الستخدام الخدمات
                  ستكون دقيقة وموثوقة، و )ث( عيوب التشغيل أو العمل في أي برنامج
                  يتم توفيره لك كجزء من الخدمات سيتم إصالحها.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  إن تحميل أية مادة أو الحصول عليها من خالل استعمال الخدمات يتم
                  بمحض اختيارك وعلى مسؤوليتك وأن المسؤولية تقع عليك وحدك عن أي
                  ضرر قد يلحق بجهاز الكمبيوتر أو أي جهاز آخر عائد لك أو فقدان
                  معلومات نتيجة لتحميل تلك المادة.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .إن أية نصيحة أو معلومة، شفهية كانت أم خطية، تحصل عليها من
                  network y muze أو من الخدمات أو من خاللها لن تشكل ضمانا غير
                  منصوص عليه صراحة في الشروط.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  ما تخلي network y muze نفسها تماما من أية مسؤولية عن جميع
                  الضمانات والشروط أيا كانت، سواء صريحة أم ضمنية، بما فيها ودون
                  حصر الضمانات والشروط الضمنية المتعلقة بإمكانية التسويق أو
                  الصالحية لغرض محدد وعدم االنتهاك.
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              رابع عشر : محدودية المسؤولية{" "}
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  مراعاة إنك تدرك تماما وتوافق على أن network y muze وشركاتها
                  الفرعية والشقيقة واألطراف التي تم الترخيص من قبلها، لن تتحمل
                  أية مسؤولية عن: )أ ( أية أضرار مباشرة أو غير مباشرة أوعرضية
                  أوتبعية خاصة أو اتعاظية قد تتكبدها أنت، وأيا كان سببها وتحت
                  أية نظرية من نظريات المسؤولية. ويشمل ذلك دون حصر أي فقدان
                  للربح )سواء وقع بصورة مباشرة أو غير مباشرة( وأية خسارة في
                  الشهرة أو السمعة التجارية وأي فقدان يحدث للبيانات وأي تكلفة
                  لشراء سلع أو خدمات بديلة أو أية خسارة غير ملموسة، )ب( أية
                  خسارة أو ضرر قد يلحق بك،
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              خامس عشر : اإلعالنات{" "}
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .هناك بعض الخدمات المدعومة من إيرادات اإلعالنات ويمكن أن تعرض
                  إعالنات ومواد ترويجية. وهذه اإلعالنات قد تستهدف محتوى
                  المعلومات المخزنة على الخدمات، االستفسارات التي تتم من خالل
                  الخدمات أو معلومات أخرى .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  {" "}
                  مقابل منح network y muze لك إمكانية الدخول إلى الخدمات
                  واستعمالها، فإنك توافق على أنه يجوز لشركة Google وضع تلك
                  اإلعالنات على الخدمات .
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              سادس عشر : تعديل الشروط
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .يمكن لشركة network y muze أن تجري تعديالت على الشروط العامة
                  أو الشروط اإلضافية من وقت آلخر. وسيتم تزويدك بأية شروط إضافية
                  من داخل الخدمات التي يطرأ التعديل عليها أو بواسطتها .
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  .إنك تدرك وتوافق على أنه إذا ما استعملت الخدمات بعد التاريخ
                  الذي تعدل فيه الشروط العامة أوالشروط اإلضافية، فإن network y
                  muze سوف تعتبر استعمالك للخدمات بمثابة قبول بالشروط العامة
                  والشروط اإلضافية المعدلة.
                </Text>
              </View>
            </View>
          </View>
          <Text>{"\n"}</Text>
          <View>
            <Text style={{ direction: "rtl", fontWeight: "bold" }}>
              سابع عشر .الشروط القانونية العامة{" "}
            </Text>
            <Text>{"\n"}</Text>
            <Text>{"\n"}</Text>
            <View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  في بعض األحيان عندما تستعمل الخدمات، قد تستعمل )نتيجة استعمالك
                  للخدمات أو من خالله( خدمة أو تحمل جزءاً من برنامج، أو تشتري
                  بضاعة يوفرها شخص آخر أو شركة أخرى. وقد يخضع استعمالك لهذه
                  الخدمات أو البرامج أو السلع األخرى لشروط منفصلة بينك وبين
                  الشركة أو الشخص المعني. فإذا كان األمر كذلك، فإن الشروط ال
                  تؤثر على عالقتك القانونية بتلك الشركات األخرى أو األفراد
                  اآلخرين
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  . إنك تقر وتوافق على أن كل عضو في مجموعة الشركات التابعة لـ
                  network y muze سيعتبر طرفا ثالثا مستفيدا من االشروط وأنه سيكون
                  لتلك الشركات األخرى الحق في التنفيذ المباشر واالعتماد على أي
                  نص من نصوص الشروط التي تعطي منفعة لها )أو حقوقا لصالحها(.
                  بخالف ذلك، فليس ألي شخص أو شركة أن يكون طرفا ثالثا مستفيدا من
                  هذه الشروط.
                </Text>
              </View>
              <View>
                <Text style={{ direction: "rtl" }}>
                  تخضع الشروط، وعالقتك مع network y muze بمقتضى الشروط، لقوانين
                  لجمهورية مصر العربية بصرف النظر عن نصوصها القانونية بشأن نزاع
                  القوانين.
                </Text>
              </View>
            </View>
          </View>
        </View>
      </ScrollView>
    </View>
  );
};

export default TermsAndConditionsAr;

const styles = StyleSheet.create({});
